# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR with Mamba-YOLO backbone

nc: 80
scales:
  l: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]        # 0-P2/4
  - [-1, 3, VSSBlock, [128]]             # 1
  - [-1, 1, VisionClueMerge, [256]]      # 2-P3/8
  - [-1, 3, VSSBlock, [256]]             # 3
  - [-1, 1, VisionClueMerge, [512]]      # 4-P4/16
  - [-1, 3, VSSBlock, [512]]             # 5
  - [-1, 1, VisionClueMerge, [1024]]     # 6-P5/32
  - [-1, 3, VSSBlock, [1024]]            # 7

head:
  # 输入投影 + AIFI (对应 P5)
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]                       # 9

  # 上采样分支 (FPN)
  - [-1, 1, Conv, [256, 1, 1]]                     # 10 Y5 lateral_convs.0
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 12 input_proj.1 (来自 P4)
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]                          # 14 fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                     # 15 Y4 lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 17 input_proj.0 (来自 P3)
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]                          # 19 fpn_blocks.1 (P3/8)

  # 下采样分支 (PAN)
  - [-1, 1, Conv, [256, 3, 2]]                     # 20 downsample_convs.0
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]                          # 22 pan_blocks.0 (P4/16)

  - [-1, 1, Conv, [256, 3, 2]]                     # 23 downsample_convs.1
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, RepC3, [256]]                          # 25 pan_blocks.1 (P5/32)

  - [[19, 22, 25], 1, RTDETRDecoder, [nc]]         # Detect(P3, P4, P5)