# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR with Mamba-YOLO backbone (No AIFI version)

nc: 80

scales:
  T: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, SimpleStem, [128, 3]]        # 0-P2/4,  160×160
  - [-1, 3, VSSBlock, [128]]             # 1
  - [-1, 1, VisionClueMerge, [256]]      # 2-P3/8,  80×80
  - [-1, 3, VSSBlock, [256]]             # 3
  - [-1, 1, VisionClueMerge, [512]]      # 4-P4/16, 40×40
  - [-1, 9, VSSBlock, [512]]             # 5
  - [-1, 1, VisionClueMerge, [1024]]     # 6-P5/32, 20×20
  - [-1, 3, VSSBlock, [1024]]            # 7

head:
  # input_proj: 将 Backbone 多尺度特征投影到 256 维
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 8  P3/8  (来自第3层, 80×80)
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 9  P4/16 (来自第5层, 40×40)
  - [7, 1, Conv, [256, 1, 1, None, 1, 1, False]]   # 10 P5/32 (来自第7层, 20×20)

    # 新增：轻量 SSM 增强（仅 P5，计算量最小）
  - [-1, 1, VSSBlock, [256]]                       # 11 SSM增强P5语义

  # FPN 从增强后的 P5 开始
  - [-1, 1, Conv, [256, 1, 1]]                     # 12 lateral_conv P5
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 13
  - [[-1, 9], 1, Concat, [1]]                      # 14
  - [-1, 3, RepC3, [256]]                          # 15
  # ... 后续层索引顺延 ...

  # CCFF: Top-down FPN
  - [10, 1, Conv, [256, 1, 1]]                     # 16 lateral_conv P5, 20×20
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 17 40×40
  - [[-1, 9], 1, Concat, [1]]                      # 18 ✅ cat Upsample(P5) 和 P4_proj
  - [-1, 3, RepC3, [256]]                          # 19 fpn_block, 40×40

  - [-1, 1, Conv, [256, 1, 1]]                     # 20 lateral_conv P4, 40×40
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 21 80×80
  - [[-1, 8], 1, Concat, [1]]                      # 22 ✅ cat Upsample(P4) 和 P3_proj
  - [-1, 3, RepC3, [256]]                          # 23 fpn_block, 80×80 (P3/8)

  # CCFF: Bottom-up PAN
  - [-1, 1, Conv, [256, 3, 2]]                     # 24 downsample P3→P4, 40×40
  - [[-1, 15], 1, Concat, [1]]                     # 25 ✅ cat downsample(P3) 和 lateral_conv P4
  - [-1, 3, RepC3, [256]]                          # 26 pan_block, 40×40 (P4/16)

  - [-1, 1, Conv, [256, 3, 2]]                     # 27 downsample P4→P5, 20×20
  - [[-1, 11], 1, Concat, [1]]                     # 28 ✅ cat downsample(P4) 和 lateral_conv P5
  - [-1, 3, RepC3, [256]]                          # 29 pan_block, 20×20 (P5/32)

  - [[18, 21, 24], 1, RTDETRDecoder, [nc]]         # Detect(P3, P4, P5)