nc: 80
scales:
  L: [0.67, 0.75, 768]

backbone:
  - [-1, 1, SimpleStem, [256, 3]]   # 0-P2/4, C=64 (width=0.25)
  - [-1, 6, VSSBlock, [256]]        # 1
  - [-1, 1, VisionClueMerge, [256]] # 2-P3/8  (原 256 不变)
  - [-1, 3, VSSBlock, [256]]        # 3
  - [-1, 1, VisionClueMerge, [512]] # 4-P4/16
  - [-1, 9, VSSBlock, [512]]        # 5
  - [-1, 1, VisionClueMerge, [1024]]# 6-P5/32
  - [-1, 3, VSSBlock, [1024]]       # 7
  - [-1, 1, SPPF, [1024, 5]]        # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [256]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [128]]

  - [-1, 1, VisionClueMerge, [128]]     # 只改 P2→P3 为 VisionClueMerge
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, XSSBlock, [1024]]

  - [[17, 20, 23, 26], 1, Detect, [nc]]
